---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DocumentChangedEventArgs..::..GetModifiedElementIds Method
DocumentChangedEventArgs Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetModifiedElementIds()()()() | Returns set of elements that were modified. |
|  | GetModifiedElementIds(ElementFilter) | Returns set of elements that were modified according to the given element filter. |

# See Also

DocumentChangedEventArgs Class

DocumentChangedEventArgs Members

Autodesk.Revit.DB.Events Namespace